# https://github.com/guptarohit/dotfiles/blob/main/Brewfile

# Binaries
brew 'zsh' # zsh (latest)
brew 'stow' # symlink manager
brew 'tree' # pretty-print directory contents
brew 'neovim' # vim (latest)
brew 'git' # git version control (latest version)
brew 'fastfetch' # system info script
brew 'lazygit' # TUI for git commands
brew 'ripgrep' # fast grep
brew 'gnupg' # tool for managing pgp keys
brew 'pinentry-mac' # tool that allow GnuPG to read passphrases
brew 'iterm2' # terminal emulator

# Apps
cask 'obsidian'
cask 'spotify'
cask 'docker'
cask 'discord'
cask 'zoom'

# Fonts
cask 'font-jetbrains-mono'
cask 'font-jetbrains-mono-nerd-font'
